Repository: pingfangx/TranslatorX-other
Catalog: JavaDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Returns the greater of two int values as if by calling Math.max.
zh_cn: 返回两个 int 值中的较大值，就像调用 Math.max 一样。

source: Returns the greater of two int values.
zh_cn: 返回两个 int 值中较大的一个。

source: Returns the greater of two long values as if by calling Math.max.
zh_cn: 返回两个 long 值中的较大值，就像调用 Math.max 一样。

source: Returns the greater of two long values.
zh_cn: 返回两个 long 值中较大的一个。

source: Returns the handler invoked when this thread abruptly terminates due to an uncaught exception.
zh_cn: 返回该线程由于未捕获到异常而突然终止时调用的处理程序。

source: Returns the hash code of this annotation, as defined below:
zh_cn: 返回此 annotation 的哈希码，具体说明如下：

source: Returns the hash code value for this map.
zh_cn: 返回此映射的哈希码值。

source: Returns the hyperbolic cosine of a double value.
zh_cn: 返回 double 值的双曲线余弦。

source: Returns the hyperbolic sine of a double value.
zh_cn: 返回 double 值的双曲线正弦。

source: Returns the hyperbolic tangent of a double value.
zh_cn: 返回 double 值的双曲线余弦。

source: Returns the identifier of this Thread.
zh_cn: 返回该线程的标识符。

source: Returns the immediately enclosing class of the underlying class.
zh_cn: 返回底层类的立即封闭类。

source: Returns the index within the given char subarray that is offset from the given index by codePointOffset code points.
zh_cn: 返回给定 char 子数组中的索引，它是从给定 index 到 codePointOffset 代码点的偏移量。

source: Returns the index within the given char sequence that is offset from the given index by codePointOffset code points.
zh_cn: 返回给定字符序列中的索引，它是从给定 index 到 codePointOffset 代码点的偏移量。

source: Returns the index within this String that is offset from the given index by codePointOffset code points.
zh_cn: 返回此 String 中从给定的 index 处偏移 codePointOffset 个代码点的索引。

source: Returns the index within this sequence that is offset from the given index by codePointOffset code points.
zh_cn: 返回此序列中的一个索引，该索引是从给定 index 偏移 codePointOffset 个代码点后得到的。

source: Returns the index within this string of the first occurrence of the specified character, starting the search at the specified index.
zh_cn: 返回在此字符串中第一次出现指定字符处的索引，从指定的索引开始搜索。

source: Returns the index within this string of the first occurrence of the specified character.
zh_cn: 返回指定字符在此字符串中第一次出现处的索引。

source: Returns the index within this string of the first occurrence of the specified substring, starting at the specified index.
zh_cn: 返回指定子字符串在此字符串中第一次出现处的索引，从指定的索引开始。

source: Returns the index within this string of the first occurrence of the specified substring.
zh_cn: 返回指定子字符串在此字符串中第一次出现处的索引。

source: Returns the index within this string of the last occurrence of the specified character, searching backward starting at the specified index.
zh_cn: 返回指定字符在此字符串中最后一次出现处的索引，从指定的索引处开始进行反向搜索。

source: Returns the index within this string of the last occurrence of the specified character.
zh_cn: 返回指定字符在此字符串中最后一次出现处的索引。

source: Returns the index within this string of the last occurrence of the specified substring, searching backward starting at the specified index.
zh_cn: 返回指定子字符串在此字符串中最后一次出现处的索引，从指定的索引开始反向搜索。

source: Returns the index within this string of the last occurrence of the specified substring.
zh_cn: 返回指定子字符串在此字符串中最后一次出现处的索引。

source: Returns the index within this string of the rightmost occurrence of the specified substring.
zh_cn: 返回最右边出现的指定子字符串在此字符串中的索引。

source: Returns the input stream connected to the error output of the subprocess.
zh_cn: 返回连接到子进程的错误输出的输入流。

source: Returns the input stream connected to the normal output of the subprocess.
zh_cn: 返回连接到子进程的正常输出的输入流。

source: Returns the integer value of the system property with the specified name.
zh_cn: 返回具有指定名称的系统属性的整数值。

source: Returns the invocation handler for the specified proxy instance.
zh_cn: 返回指定代理实例的调用处理程序。

source: Returns the largest (closest to positive infinity) double value that is less than or equal to the argument and is equal to a mathematical integer.
zh_cn: 返回最大的（最接近正无穷大）double 值，该值小于等于参数，并等于某个整数。

source: Returns the largest (closest to positive infinity) int value that is less than or equal to the algebraic quotient.
zh_cn: 返回最大的(最接近正无穷大)int 值，该值小于或等于代数商。

source: Returns the largest (closest to positive infinity) long value that is less than or equal to the algebraic quotient.
zh_cn: 返回最大的(最接近正无穷大)long 值，该值小于或等于代数商。

source: Returns the largest number of threads that have ever simultaneously been in the pool.
zh_cn: 返回曾经同时位于池中的最大线程数。

source: Returns the length (character count).
zh_cn: 返回长度（字符数）。

source: Returns the length of the specified array object, as an int.
zh_cn: 以 int 形式返回指定数组对象的长度。

source: Returns the length of this character sequence.
zh_cn: 返回此字符序列的长度。

source: Returns the length of this string.
zh_cn: 返回此字符串的长度。

source: Returns the line number of the source line containing the execution point represented by this stack trace element.
zh_cn: 返回源行的行号，该行包含由该堆栈该跟踪元素所表示的执行点。

source: Returns the maximum allowed number of threads.
zh_cn: 返回允许的最大线程数。

source: Returns the maximum amount of memory that the Java virtual machine will attempt to use.
zh_cn: 返回 Java 虚拟机试图使用的最大内存量。

source: Returns the maximum priority of this thread group.
zh_cn: 返回此线程组的最高优先级。

source: Returns the name of the entity (class, interface, array class, primitive type, or void) represented by this Class object, as a String.
zh_cn: 以 String 的形式返回此 Class 对象所表示的实体（类、接口、数组类、基本类型或 void）名称。

source: Returns the name of the field represented by this Field object.
zh_cn: 返回此 Field 对象表示的字段的名称。

source: Returns the name of the method containing the execution point represented by this stack trace element.
zh_cn: 返回方法名，此方法包含由该堆栈跟踪元素所表示的执行点。

source: Returns the name of the method represented by this Method object, as a String.
zh_cn: 以 String 形式返回此 Method 对象表示的方法名称。

source: Returns the name of the missing element.
zh_cn: 返回缺少元素的名称。

source: Returns the name of the source file containing the execution point represented by this stack trace element.
zh_cn: 返回源文件名，该文件包含由该堆栈跟踪元素所表示的执行点。

source: Returns the name of this constructor, as a string.
zh_cn: 以字符串形式返回此构造方法的名称。

source: Returns the name of this enum constant, as contained in the declaration.
zh_cn: 返回枚举常量的名称，它包含在声明中。

source: Returns the name of this enum constant, exactly as declared in its enum declaration.
zh_cn: 返回此枚举常量的名称，在其枚举声明中对其进行声明。

source: Returns the name of this subset.
zh_cn: 返回该子集的名称。

source: Returns the name of this thread group.
zh_cn: 返回此线程组的名称。

source: Returns the name of this type variable, as it occurs in the source code.
zh_cn: 返回此类型变量的名称，它出现在源代码中。

source: Returns the natural logarithm (base e) of a double value.
zh_cn: 返回 double 值的自然对数（底数是 e）。

source: Returns the natural logarithm of the sum of the argument and 1.
zh_cn: 返回参数与 1 之和的自然对数。

source: Returns the negation of the argument, throwing an exception if the result overflows a long.
zh_cn: 返回参数的反数，如果结果溢出 long，则抛出异常。

source: Returns the negation of the argument, throwing an exception if the result overflows an int.
zh_cn: 返回参数的反数，如果结果溢出 int，则抛出异常。

source: Returns the number of Unicode code points in a subarray of the char array argument.
zh_cn: 返回 char 数组参数的子数组中 Unicode 代码点的数量。

source: Returns the number of Unicode code points in the specified text range of this String.
zh_cn: 返回此 String 的指定文本范围中的 Unicode 代码点数。

source: Returns the number of Unicode code points in the specified text range of this sequence.
zh_cn: 返回此序列指定文本范围内的统一代码点。

source: Returns the number of Unicode code points in the text range of the specified char sequence.
zh_cn: 返回指定字符序列的文本范围内的 Unicode 代码点数量。

source: Returns the number of key-value mappings in this map.
zh_cn: 返回此映射中的键-值映射关系数。

source: Returns the number of one-bits in the two's complement binary representation of the specified int value.
zh_cn: 返回指定 int 值的二进制补码表示形式的 1 位的数量。

source: Returns the number of one-bits in the two's complement binary representation of the specified long value.
zh_cn: 返回指定 long 值的二进制补码表示形式中的 1 位的数量。

source: Returns the number of processors available to the Java virtual machine.
zh_cn: 返回 Java 虚拟机可以使用的处理器数目。

source: Returns the number of zero bits following the lowest-order ("rightmost") one-bit in the two's complement binary representation of the specified int value.
zh_cn: 返回指定的 int 值的二进制补码表示形式中最低（“最右边”）的为 1 的位后面的零位个数。

source: Returns the number of zero bits following the lowest-order ("rightmost") one-bit in the two's complement binary representation of the specified long value.
zh_cn: 返回在指定 long 值的二进制补码表示形式中最低位（最右边）的 1 位之后的零位的数量。

source: Returns the number of zero bits preceding the highest-order ("leftmost") one-bit in the two's complement binary representation of the specified int value.
zh_cn: 在指定 int 值的二进制补码表示形式中最高位（最左边）的 1 位之前，返回零位的数量。

source: Returns the number of zero bits preceding the highest-order ("leftmost") one-bit in the two's complement binary representation of the specified long value.
zh_cn: 在指定 long 值的二进制补码表示形式中最高位（最左边）的 1 位之前，返回零位的数量。

source: Returns the numeric value of the character ch in the specified radix.
zh_cn: 返回使用指定基数的字符 ch 的数值。

source: Returns the numeric value of the specified character (Unicode code point) in the specified radix.
zh_cn: 返回使用指定基数的指定字符（Unicode 代码点）的数值。

source: Returns the ordinal of this enumeration constant (its position in its enum declaration, where the initial constant is assigned an ordinal of zero).
zh_cn: 返回枚举常量的序数（它在枚举声明中的位置，其中初始常量序数为零）。

source: Returns the output stream connected to the normal input of the subprocess.
zh_cn: 返回连接到子进程的正常输入的输出流。

source: Returns the parent class loader for delegation.
zh_cn: 返回委托的父类加载器。

source: Returns the parent of this thread group.
zh_cn: 返回此线程组的父线程组。

source: Returns the product of the arguments, throwing an exception if the result overflows a long.
zh_cn: 返回参数的乘积，如果结果溢出 long，则抛出异常。

source: Returns the product of the arguments, throwing an exception if the result overflows an int.
zh_cn: 返回参数的乘积，如果结果溢出 int，则抛出异常。

source: Returns the result of applying the logical AND operator to the specified boolean operands.
zh_cn: 返回对指定的 boolean 操作数应用逻辑与运算符的结果。

source: Returns the result of applying the logical OR operator to the specified boolean operands.
zh_cn: 返回对指定的 boolean 操作数应用逻辑或运算符的结果。

source: Returns the result of applying the logical XOR operator to the specified boolean operands.
zh_cn: 返回对指定的 boolean 操作数应用逻辑异或运算符的结果。

source: Returns the runtime class of this Object.
zh_cn: 返回此 Object 的运行时类。

source: Returns the runtime object associated with the current Java application.
zh_cn: 返回与当前 Java 应用程序相关的运行时对象。

source: Returns the same hash code for the given object as would be returned by the default method hashCode(), whether or not the given object's class overrides hashCode().
zh_cn: 返回给定对象的哈希码，该代码与默认的方法 hashCode() 返回的代码一样，无论给定对象的类是否重写 hashCode()。

source: Returns the signum function of the argument; zero if the argument is zero, 1.0 if the argument is greater than zero, -1.0 if the argument is less than zero.
zh_cn: 返回参数的符号函数；如果参数为 0，则返回 0；如果参数大于 0，则返回 1.0；如果参数小于 0，则返回 -1.0。

source: Returns the signum function of the argument; zero if the argument is zero, 1.0f if the argument is greater than zero, -1.0f if the argument is less than zero.
zh_cn: 返回参数的符号函数；如果参数为 0，则返回 0；如果参数大于 0，则返回 1.0；如果参数小于 0，则返回 -1.0。

source: Returns the signum function of the specified int value.
zh_cn: 返回指定 int 值的符号函数。

source: Returns the signum function of the specified long value.
zh_cn: 返回指定 long 值的符号函数。

source: Returns the simple name of the underlying class as given in the source code.
zh_cn: 返回源代码中给出的底层类的简称。

source: Returns the simple name of the underlying member or constructor represented by this Member.
zh_cn: 返回此 Member 表示的底层成员或构造方法的简单名称。

source: Returns the size of an ulp of the argument.
zh_cn: 返回参数的 ulp 大小。

source: Returns the smaller of two double values as if by calling Math.min.
zh_cn: 返回两个 double 值中的较小值，就像调用 Math.min 一样。

source: Returns the smaller of two double values.
zh_cn: 返回两个 double 值中较小的一个。

source: Returns the smaller of two float values as if by calling Math.min.
zh_cn: 返回两个 float 值中的较小值，就像调用 Math.min 一样。

source: Returns the smaller of two float values.
zh_cn: 返回两个 float 值中较小的一个。

source: Returns the smaller of two int values as if by calling Math.min.
zh_cn: 返回两个 int 值中的较小值，就像调用 Math.min 一样。

source: Returns the smaller of two int values.
zh_cn: 返回两个 int 值中较小的一个。

source: Returns the smaller of two long values as if by calling Math.min.
zh_cn: 返回两个 long 值中的较小值，就像调用 Math.min 一样。

source: Returns the smaller of two long values.
zh_cn: 返回两个 long 值中较小的一个。

source: Returns the smallest (closest to negative infinity) double value that is greater than or equal to the argument and is equal to a mathematical integer.
zh_cn: 返回最小的（最接近负无穷大）double 值，该值大于等于参数，并等于某个整数。

source: Returns the standard hash code as defined by the hashCode() method.
zh_cn: 返回 hashCode() 方法定义的标准哈希码。

source: Returns the state of this thread.
zh_cn: 返回该线程的状态。

source: Returns the string representation of a specific subarray of the char array argument.
zh_cn: 返回 char 数组参数的特定子数组的字符串表示形式。

source: Returns the string representation of the Object argument.
zh_cn: 返回 Object 参数的字符串表示形式。

source: Returns the string representation of the boolean argument.
zh_cn: 返回 boolean 参数的字符串表示形式。

source: Returns the string representation of the char argument.
zh_cn: 返回 char 参数的字符串表示形式。

source: Returns the string representation of the char array argument.
zh_cn: 返回 char 数组参数的字符串表示形式。

source: Returns the string representation of the double argument.
zh_cn: 返回 double 参数的字符串表示形式。

source: Returns the string representation of the float argument.
zh_cn: 返回 float 参数的字符串表示形式。

source: Returns the string representation of the int argument.
zh_cn: 返回 int 参数的字符串表示形式。

source: Returns the string representation of the long argument.
zh_cn: 返回 long 参数的字符串表示形式。

source: Returns the sum of its arguments, throwing an exception if the result overflows a long.
zh_cn: 返回其参数的和，如果结果溢出 long，则抛出异常。

source: Returns the sum of its arguments, throwing an exception if the result overflows an int.
zh_cn: 返回其参数的和，如果结果溢出 int，则抛出异常。

source: Returns the system class loader for delegation.
zh_cn: 返回委托的系统类加载器。

source: Returns the system-dependent line separator string.
zh_cn: 返回系统相关的行分隔符字符串。

source: Returns the task queue used by this executor.
zh_cn: 返回此执行程序使用的任务队列。

source: Returns the thread factory used to create new threads.
zh_cn: 返回用于创建新线程的线程工厂。

source: Returns the thread group to which this thread belongs.
zh_cn: 返回该线程所属的线程组。

source: Returns the thread keep-alive time, which is the amount of time that threads may remain idle before being terminated.
zh_cn: 返回线程保持活动时间，即线程在终止之前可能保持空闲的时间量。

source: Returns the total amount of memory in the Java virtual machine.
zh_cn: 返回 Java 虚拟机中的内存总量。

source: Returns the trigonometric cosine of an angle.
zh_cn: 返回角的三角余弦。

source: Returns the trigonometric sine of an angle.
zh_cn: 返回角的三角正弦。

source: Returns the trigonometric tangent of an angle.
zh_cn: 返回角的三角正切。

source: Returns the type of data found in the incorrectly typed element.
zh_cn: 返回在类型不正确的元素中找到的数据类型。

source: Returns the unbiased exponent used in the representation of a double.
zh_cn: 返回 double 表示形式中使用的无偏指数。

source: Returns the unbiased exponent used in the representation of a float.
zh_cn: 返回 float 表示形式中使用的无偏指数。

source: Returns the unique Console object associated with the current Java virtual machine, if any.
zh_cn: 返回与当前 Java 虚拟机关联的唯一 Console 对象（如果有）。

source: Returns the value in the current thread's copy of this thread-local variable.
zh_cn: 返回此线程局部变量的当前线程副本中的值。

source: Returns the value obtained by reversing the order of the bits in the two's complement binary representation of the specified int value.
zh_cn: 返回通过反转指定 int 值的二进制补码表示形式中位的顺序而获得的值。

source: Returns the value obtained by reversing the order of the bits in the two's complement binary representation of the specified long value.
zh_cn: 返回通过反转指定 long 值的二进制补码表示形式中位的顺序而获得的值。

source: Returns the value obtained by reversing the order of the bytes in the specified char value.
zh_cn: 返回通过反转指定 char 值中的字节顺序而获得的值。

source: Returns the value obtained by reversing the order of the bytes in the two's complement representation of the specified int value.
zh_cn: 返回通过反转指定 int 值的二进制补码表示形式中字节的顺序而获得的值。

source: Returns the value obtained by reversing the order of the bytes in the two's complement representation of the specified long value.
zh_cn: 返回通过反转指定 long 值的二进制补码表示形式中字节的顺序而获得的值。

source: Returns the value obtained by reversing the order of the bytes in the two's complement representation of the specified short value.
zh_cn: 返回通过反转指定 short 值的二进制补码表示形式中字节的顺序而获得的值。

source: Returns the value obtained by rotating the two's complement binary representation of the specified int value left by the specified number of bits.
zh_cn: 返回根据指定的位数循环左移指定的 int 值的二进制补码表示形式而得到的值。

source: Returns the value obtained by rotating the two's complement binary representation of the specified int value right by the specified number of bits.
zh_cn: 返回根据指定的位数循环右移指定的 int 值的二进制补码表示形式而得到的值。

source: Returns the value obtained by rotating the two's complement binary representation of the specified long value left by the specified number of bits.
zh_cn: 返回根据指定的位数循环左移指定的 long 值的二进制补码表示形式而得到的值。

source: Returns the value obtained by rotating the two's complement binary representation of the specified long value right by the specified number of bits.
zh_cn: 返回根据指定的位数循环右移指定的 long 值的二进制补码表示形式而得到的值。

source: Returns the value of the long argument; throwing an exception if the value overflows an int.
zh_cn: 返回 long 参数的值；如果该值溢出的 int 则抛出异常。

source: Returns the value of the field represented by this Field, on the specified object.
zh_cn: 返回指定对象上此 Field 表示的字段的值。

source: Returns the value of the first argument raised to the power of the second argument.
zh_cn: 返回第一个参数的第二个参数次幂的值。

source: Returns the value of the indexed component in the specified array object, as a boolean.
zh_cn: 以 boolean 形式返回指定数组对象中索引组件的值。

source: Returns the value of the indexed component in the specified array object, as a byte.
zh_cn: 以 byte 形式返回指定数组对象中索引组件的值。

source: Returns the value of the indexed component in the specified array object, as a char.
zh_cn: 以 char 形式返回指定数组对象中索引组件的值。

source: Returns the value of the indexed component in the specified array object, as a double.
zh_cn: 以 double 形式返回指定数组对象中索引组件的值。

source: Returns the value of the indexed component in the specified array object, as a float.
zh_cn: 以 float 形式返回指定数组对象中索引组件的值。

source: Returns the value of the indexed component in the specified array object, as a long.
zh_cn: 以 long 形式返回指定数组对象中索引组件的值。

source: Returns the value of the indexed component in the specified array object, as a short.
zh_cn: 以 short 形式返回指定数组对象中索引组件的值。

source: Returns the value of the indexed component in the specified array object, as an int.
zh_cn: 以 int 形式返回指定数组对象中索引组件的值。

source: Returns the value of the indexed component in the specified array object.
zh_cn: 返回指定数组对象中索引组件的值。

source: Returns the value of the specified number as a byte.
zh_cn: 以 byte 形式返回指定的数值。

source: Returns the value of the specified number as a double.
zh_cn: 以 double 形式返回指定的数值。

source: Returns the value of the specified number as a float.
zh_cn: 以 float 形式返回指定的数值。

source: Returns the value of the specified number as a long.
zh_cn: 以 long 形式返回指定的数值。

source: Returns the value of the specified number as a short.
zh_cn: 以 short 形式返回指定的数值。

source: Returns the value of the specified number as an int.
zh_cn: 以 int 形式返回指定的数值。

source: Returns the value of this Boolean object as a boolean primitive.
zh_cn: 将此 Boolean 对象的值作为基本布尔值返回。

source: Returns the value of this Byte as a byte.
zh_cn: 作为一个 byte 返回此 Byte 的值。

source: Returns the value of this Byte as a double.
zh_cn: 作为一个 double 返回此 Byte 的值。

source: Returns the value of this Byte as a float.
zh_cn: 作为一个 float 返回此 Byte 的值。

source: Returns the value of this Byte as a long.
zh_cn: 作为一个 long 返回此 Byte 的值。

source: Returns the value of this Byte as a short.
zh_cn: 作为一个 short 返回此 Byte 的值。

source: Returns the value of this Byte as an int.
zh_cn: 作为一个 int 返回此 Byte 的值。

source: Returns the value of this Character object.
zh_cn: 返回此 Character 对象的值。

source: Returns the value of this Double as a byte (by casting to a byte).
zh_cn: 以 byte 形式返回此 Double 的值（通过强制转换为 byte）。

source: Returns the value of this Double as a long (by casting to type long).
zh_cn: 以 long 形式返回此 Double 的值（通过强制转换为 long 类型）。

source: Returns the value of this Double as a short (by casting to a short).
zh_cn: 以 short 形式返回此 Double 的值（通过强制转换为 short）。

source: Returns the value of this Double as an int (by casting to type int).
zh_cn: 以 int 形式返回此 Double 的值（通过强制转换为 int 类型）。

source: Returns the value of this Float as a byte (by casting to a byte).
zh_cn: 将此 Float 值以 byte 形式返回（强制转换为 byte）。

source: Returns the value of this Float as a short (by casting to a short).
zh_cn: 将此 Float 值以 short 形式返回（强制转换为 short）。

source: Returns the value of this Float as an int (by casting to type int).
zh_cn: 将此 Float 值以 int 形式返回（强制转换为 int 类型）。

source: Returns the value of this Integer as a byte.
zh_cn: 以 byte 类型返回该 Integer 的值。

source: Returns the value of this Integer as a double.
zh_cn: 以 double 类型返回该 Integer 的值。

source: Returns the value of this Integer as a float.
zh_cn: 以 float 类型返回该 Integer 的值。

source: Returns the value of this Integer as a long.
zh_cn: 以 long 类型返回该 Integer 的值。

source: Returns the value of this Integer as a short.
zh_cn: 以 short 类型返回该 Integer 的值。

source: Returns the value of this Integer as an int.
zh_cn: 以 int 类型返回该 Integer 的值。

source: Returns the value of this Long as a byte.
zh_cn: 以 byte 形式返回此 Long 的值。

source: Returns the value of this Long as a double.
zh_cn: 以 double 形式返回此 Long 的值。

source: Returns the value of this Long as a float.
zh_cn: 以 float 形式返回此 Long 的值。

source: Returns the value of this Long as a long value.
zh_cn: 以 long 值的形式返回此 Long 的值。

source: Returns the value of this Long as a short.
zh_cn: 以 short 形式返回此 Long 的值。

source: Returns the value of this Long as an int.
zh_cn: 以 int 形式返回此 Long 的值。

source: Returns the value of this Short as a byte.
zh_cn: 以 byte 形式返回此 Short 的值。

source: Returns the value of this Short as a double.
zh_cn: 以 double 形式返回此 Short 的值。

source: Returns the value of this Short as a float.
zh_cn: 以 float 形式返回此 Short 的值。

source: Returns the value of this Short as a long.
zh_cn: 以 Long 形式返回此 Short 的值。

source: Returns the value of this Short as a short.
zh_cn: 以 short 形式返回此 Short 的值。

source: Returns the value of this Short as an int.
zh_cn: 以 int 形式返回此 Short 的值。

source: Returns the value to which the specified key is mapped, or defaultValue if this map contains no mapping for the key.
zh_cn: 返回到指定键所映射的值，或 defaultValue 如果此映射不包含该键的映射。

source: Returns the value to which the specified key is mapped, or null if this map contains no mapping for the key.
zh_cn: 返回指定键所映射的值；如果对于该键来说，此映射不包含任何映射关系，则返回 null。

source: Returns this element's annotation for the specified type if such an annotation is present, else null.
zh_cn: 如果存在该元素的指定类型的注释，则返回这些注释，否则返回 null。

source: Returns this process builder's operating system program and arguments.
zh_cn: 返回此进程生成器的操作系统程序和参数。

source: Returns this process builder's working directory.
zh_cn: 返回此进程生成器的工作目录。

source: Returns this reference object's referent.
zh_cn: 返回此引用对象的指示对象。

source: Returns this thread's name.
zh_cn: 返回该线程的名称。

source: Returns this thread's priority.
zh_cn: 返回线程的优先级。

source: Returns true if an annotation for the specified type is present on this element, else false.
zh_cn: 如果指定类型的注释存在于此元素上，则返回 true，否则返回 false。

source: Returns true if and only if the specified class was dynamically generated to be a proxy class using the getProxyClass method or the newProxyInstance method.
zh_cn: 当且仅当指定的类通过 getProxyClass 方法或 newProxyInstance 方法动态生成为代理类时，返回 true。

source: Returns true if and only if this class was declared as an enum in the source code.
zh_cn: 当且仅当该类声明为源代码中的枚举时返回 true。

source: Returns true if and only if this string contains the specified sequence of char values.
zh_cn: 当且仅当此字符串包含指定的 char 值序列时，返回 true。
